namespace Diet_Tracker.Modules;
internal class InputAndViewModule
{
    public InputAndViewModule(ReportModule reportModule, IStorageModule storageModule)
    {

    }

    internal void View()
    {
        while (true)
        {
            Console.Write($"\t═══════════════════════════════════════\n");
            Console.Write($"\t════════════ДНЕВНИК ПИТАНИЯ════════════\n");
            Console.Write($"\t═══════ 1.Добавить приём пищи ═════════\n");
            Console.Write($"\t═══════ 2.Отчёт за сегодня ════════════\n");
            Console.Write($"\t═══════ 3.Выполнение целей (КБЖУ) ═════\n");
            Console.Write($"\t═══════════════════════════════════════\n");
            Console.Write($"\t═══════ 4.Все записи ══════════════════\n");
            Console.Write($"\t═══════ 5.Отчёт за неделю ═════════════\n");
            Console.Write($"\t═══════ 0.Выход ═══════════════════════\n");
            Console.Write($"\t═══════════════════════════════════════\n");
            Console.Write($"\t═══════════════════════════════════════\n");
            var input = GetInputRangeKey(5);
        }
    }
    private int GetInputRangeKey(int range)
    {
        while(true)
        {
            var input = Console.ReadLine();
            if (int.TryParse(input, out int number))
                if (number >= 0 && number <= range)
                    return number;
            Console.WriteLine("Неверный формат ввода.");
        }
    }
}
